Repository: OscarAliaga/project_wasserschwein
Catalog: ilearn_app/lib/l10n/app_*.arb
Languages: es

# student
source: I'm a Student
es: Soy Estudiante

# parent
source: I'm a Parent
es: Soy Apoderado

# welcome
source: Welcome, {name}!
es: ¡Bienvenido, {name}!

# yourId
source: Your ID: {userId}
es: Tu ID: {userId}

# yourRole
source: Role: {role}
es: Rol: {role}

# selectCourse
source: Select your grade:
es: Selecciona tu curso:

# selectSubject
source: Select your subject:
es: Selecciona la materia:

# chooseCourseHint
source: Choose your grade
es: Elige tu curso

# chooseSubjectHint
source: Choose your subject
es: Elige la materia

# chatWithCapybara
source: Learn with Capybara
es: Ir con el tutor Capibara

source: Fun Exercises
es: Ejercicios entretenidos

# selectCourseAndSubject
source: Please select grade and subject.
es: Por favor, selecciona el curso y la materia.

# soonAvailable
source: This option will be available soon
es: Esta opción estará disponible muy pronto

# enterYourData
source: Enter your information
es: Ingresa tus datos

source: Name
es: Nombre

source: User ID
es: ID de usuario

source: Cancel
es: Cancelar

# continueText
source: Continue
es: Continuar

# selectRole
source: Configuration
es: Configuración

# dayMode
source: Daytime Mode 🌞
es: Modo Diurno 🌞

# nightMode
source: Nigh-time Mode 🌜
es: Modo Nocturno 🌜

# languageSpanish
source: Spanish
es: Español

# languageEnglish
source: English
es: Inglés

source: Language
es: Idioma

# homeStudentTitle
source: Student Home
es: Inicio del estudiante

# userUnavailable
source: User not available
es: Usuario no disponible

# course1
source: 1st Grade
es: 1° Básico

# course2
source: 2nd Grade
es: 2° Básico

# course3
source: 3rd Grade
es: 3° Básico

# course4
source: 4th Grade
es: 4° Básico

# course5
source: 5th Grade
es: 5° Básico

# course6
source: 6th Grade
es: 6° Básico

# subjectMath
source: Mathematics
es: Matemáticas

# subjectLanguage
source: Language
es: Lenguaje

# subjectHistory
source: History and Social Sciences
es: Historia y Ciencias Sociales

# subjectScience
source: Natural Sciences
es: Ciencias Naturales

# screenTitle
source: Your learning companion
es: Tu amigo que te ayuda a Aprender

# homeParentTitle
source: Parent Home
es: Inicio Apoderado

# supportLearningTitle
source: Support Your Child's Learning
es: Apoya el Aprendizaje de tu Hijo

# supportLearningSubtitle
source: Practical tips for parents and guardians
es: Consejos prácticos para padres y tutores

# linkStudentTitle
source: Link student
es: Vincular estudiante

# linkStudentSubtitle
source: Add a new student to your account.
es: Agrega un nuevo estudiante a tu cuenta.

# viewProgressTitle
source: View Learning Progress
es: Ver Progreso de Aprendizaje

# viewProgressSubtitle
source: Review your students' progress.
es: Revisa el avance de tus estudiantes.

# motivationalQuote
source: Remember that patience and love are the most important ingredients to support your children's learning.
es: Recuerda que la paciencia y el cariño son los ingredientes más importantes para apoyar el aprendizaje de tus hijos.

# learningIntro
source: Hello 👋, today we will learn {subjectName}
es: Hola 👋, hoy aprenderemos {subjectName}

source: Yes
es: Sí

# askHint
source: Ask a question to start learning
es: Haz una pregunta para comenzar a aprender

# askButton
source: Ask
es: Consultar

# imageError
source: Could not load image
es: No se pudo cargar la imagen

# noAnswerAvailable
source: Answer not available
es: Respuesta no disponible

# linkedStudentsTitle
source: Linked Students
es: Estudiantes Vinculados

# noLinkedStudents
source: No students linked yet.
es: Aún no hay estudiantes vinculados.

# unlinkConfirmTitle
source: Unlink Student
es: Desvincular Estudiante

# unlinkConfirmBody
source: Are you sure you want to unlink {studentId}?
es: ¿Estás seguro que deseas desvincular a {studentId}?

# unlinkSuccess
source: Student successfully unlinked.
es: Estudiante desvinculado correctamente.

# unlinkError
source: Error unlinking student.
es: Error al desvincular estudiante.

source: Confirm
es: Confirmar

# enterStudentId
source: Enter the student's ID to link:
es: Ingresa el ID del estudiante para vincularlo:

# studentIdLabel
source: Student ID
es: ID del estudiante

# studentIdHint
source: e.g., oscar123
es: Ej: oscar123

# linkButton
source: Link
es: Vincular

# enterValidId
source: Please enter a valid ID
es: Por favor ingresa un ID válido

# linkSuccess
source: ✅ Student linked successfully
es: ✅ Estudiante vinculado correctamente

# linkError
source: ❌ Error linking student
es: ❌ Error al vincular estudiante

# studentNotFound
source: Student ID not found in the system.
es: ID de estudiante no encontrado en el sistema.

# userIdLabel
source: User ID
es: ID de usuario

# learningProgressTitle
source: Learning Progress
es: Progreso de aprendizaje

# studentLabel
source: Student ID: {studentId}
es: Estudiante: {studentId}

# noProgressYet
source: No progress records yet.
es: Aún no hay registros de progreso.

# motivationalFooter
source: Every step counts. Keep supporting learning!
es: Cada paso cuenta. ¡Sigue apoyando el aprendizaje!

# viewDetail
source: View details
es: Ver detalle

# updatedAt
source: Updated
es: Actualizado

source: Progress reached:
es: Progreso alcanzado:

# detailIntro
source: Here you could add more details, such as:
es: Aquí podrás agregar más detalles, como:

# detailGoals
source: Covered objectives
es: Objetivos cubiertos

# detailFeedback
source: Teacher's feedback
es: Retroalimentación del profesor

# detailActivities
source: Suggested activities
es: Actividades sugeridas

# detailRecommendations
source: Personalized recommendations
es: Recomendaciones personalizadas

# tipRoutine
source: Establish a consistent homework and study routine.
es: Establece una rutina constante para tareas y estudio.

# tipEncourage
source: Encourage effort over perfection.
es: Valora el esfuerzo más que la perfección.

# tipAskQuestions
source: Ask your child what they learned today?
es: Pregúntale a tu hijo qué aprendió hoy

# tipPraiseEffort
source: Praise persistence and hard work.
es: Elogia la perseverancia y el trabajo duro.

# tipCreateSpace
source: Create a quiet and organized study space.
es: Crea un espacio tranquilo y ordenado para estudiar.

# tipUseResources
source: Use books, apps, or videos to reinforce learning.
es: Usa libros, apps o videos para reforzar el aprendizaje.

# tipTalkAboutSchool
source: Talk about school in a positive way.
es: Habla positivamente sobre la escuela.

# tipStayPositive
source: Stay calm and patient during learning challenges.
es: Mantén la calma y paciencia ante desafíos.

source: User not available
es: Usuario no disponible

# studentScreenTitle
source: Your Friend Who Helps You Learn
es: Tu Amigo que te ayuda a aprender

# introMessage
source: Hello 👋, today we'll learn {subjectName}
es: Hola 👋, hoy aprenderemos {subjectName}

# emptyQuestionWarning
source: Please write a question.
es: Por favor, escribe una pregunta.

# serverError
source: Server error: {code}. Please try again.
es: Error del servidor: {code}. Por favor, inténtalo de nuevo.

# connectionError
source: Connection error: {error}. Make sure the server is running.
es: Error de conexión: {error}. Asegúrate de que el servidor esté funcionando.

# imageLoadError
source: Could not load the image. Incorrect URL or network issue.
es: No se pudo cargar la imagen. URL incorrecta o problema de red.

# questionHint
source: Ask a question to start learning
es: Haz una pregunta para comenzar a aprender

source: Send
es: Consultar

# tipRoutineDetail
source: Establishing a consistent routine helps children feel secure and understand what to expect each day.
es: Establecer una rutina constante ayuda a los niños a sentirse seguros y a entender qué esperar cada día.

# tipEncourageDetail
source: Encourage your child’s effort and persistence, rather than focusing only on results.
es: Anima el esfuerzo y la perseverancia de tu hijo, más allá de los resultados.

# tipAskQuestionsDetail
source: Ask open-ended questions to stimulate thinking and learning conversations.
es: Haz preguntas abiertas para estimular el pensamiento y la conversación.

# tipPraiseEffortDetail
source: Praise the process—such as strategy and effort—not just intelligence or outcomes.
es: Elogia el proceso (estrategia, esfuerzo), no solo la inteligencia o los resultados.

# tipCreateSpaceDetail
source: Provide a quiet, organized space where your child can focus on learning without distractions.
es: Ofrece un espacio tranquilo y ordenado donde tu hijo pueda concentrarse sin distracciones.

# tipUseResourcesDetail
source: Make use of available learning resources like books, videos, or learning apps.
es: Aprovecha los recursos disponibles como libros, videos o apps educativas.

# tipTalkAboutSchoolDetail
source: Have regular conversations about school to stay involved and show support.
es: Habla regularmente sobre la escuela para mantenerte involucrado y mostrar apoyo.

# tipStayPositiveDetail
source: Maintain a positive attitude toward learning; your mindset can influence your child’s motivation.
es: Mantén una actitud positiva hacia el aprendizaje; tu enfoque influye en la motivación de tu hijo.

# tipAskQuestions_description
source: ❓ **Suggested question** 🗣️ *If you had to teach me one thing you learned today, what would it be?* 🧠 **Why this question works** This question is grounded in the concept of **retrieval practice**, a learning strategy supported by robust evidence (Karpicke & Roediger, 2008). Retrieval practice involves actively recalling information from memory, which: - Strengthens memory traces - Improves long-term retention - Enhances understanding and transfer of knowledge When a child is asked to teach or explain something they learned: - They reconstruct the knowledge in their own words - They engage in elaborative rehearsal, which is more effective than passive review - They boost metacognitive awareness (awareness of what they know) 👉 *Teaching others—even pretend teaching—has been shown to be particularly powerful because it forces learners to organize and clarify their understanding* (Fiorella & Mayer, 2013).
es: ❓ **Pregunta sugerida** 🗣️ *Si tuvieras que enseñarme una cosa que aprendiste hoy, ¿qué sería?* 🧠 **Por qué esta pregunta funciona** Esta pregunta se basa en el concepto de **práctica de recuperación**, una estrategia de aprendizaje respaldada por evidencia sólida (Karpicke & Roediger, 2008). La práctica de recuperación implica recordar activamente información desde la memoria, lo cual: - Fortalece las huellas de memoria - Mejora la retención a largo plazo - Aumenta la comprensión y la transferencia del conocimiento Cuando se le pide a un niño que enseñe o explique algo que aprendió: - Reconstruye el conocimiento con sus propias palabras - Se involucra en un repaso elaborativo, más efectivo que una revisión pasiva - Aumenta su conciencia metacognitiva (es decir, lo que sabe sobre lo que sabe) 👉 *Enseñar a otros — incluso de forma ficticia — ha demostrado ser particularmente poderoso porque obliga a los estudiantes a organizar y clarificar su comprensión* (Fiorella & Mayer, 2013).

# tipGeneric_description
source: This tip is designed to help you support your child’s learning in a caring, effective, and positive way. Soon, you’ll find practical suggestions, educational insights, and easy-to-apply examples right here. Something great is on the way! 💡
es: Este consejo está diseñado para ayudarte a apoyar el aprendizaje de tu hijo de forma cercana, efectiva y positiva. Aquí pronto encontrarás sugerencias prácticas, fundamentos pedagógicos y ejemplos fáciles de aplicar en casa. ¡Estamos preparando algo especial para ti! 💡

source: Learn more
es: Aprender más

source: Show less
es: Mostrar menos

# unitRecommendationTitle
source: Parent Tip
es: Recomendación para el Apoyo
